CytronTechnologies/DIY-PR29-PIC16F876A/PIC16F876A DIY PR29/Source file/PR29.c
//==========================================================================
//	Author				: Cytron Technologies		
//	Project				: Sending Data using RF Module
//	Project description             : The transmitter will send 0->F (data in Hexadecimal).
//                                        This project use PIC16F876A.Compatible with
//                                        MPLAB IDE with HITECH C compiler v 9.80/v9.83 or
//                                        using MPLABX with HITECH C compiler v 9.80/v9.83 and XC8 compiler.
//==========================================================================

//===================================================================================
//	include
//===================================================================================

#include "uart_io.h"		//to enable another programmed UART

#if defined(__XC8)
   #include <xc.h>
   #pragma config CONFIG = 0x3F32
#else
#include <htc.h>                  //include the PIC microchip header file

//===================================================================================
//	configuration
//===================================================================================
__CONFIG (0x3F32);
//FOSC = HS        // Oscillator Selection bits (HS oscillator)
//WDTE = OFF       // Watchdog Timer Enable bit (WDT disabled)
//PWRTE = ON       // Power-up Timer Enable bit (PWRT enabled)
//BOREN = OFF      // Brown-out Reset Enable bit (BOR disabled)
//LVP = OFF        // Low-Voltage (Single-Supply) In-Circuit Serial Programming Enable bit (RB3 is digital I/O, HV on MCLR must be used for programming)
//CPD = OFF        // Data EEPROM Memory Code Protection bit (Data EEPROM code protection off)
//WRT = OFF        // Flash Program Memory Write Enable bits (Write protection off; all program memory may be written to by EECON control)
//CP = OFF         // Flash Program Memory Code Protection bit (Code protection off)
#endif
//===================================================================================
//	define
//===================================================================================
#define LED_RED		RA0     //red LED (Active HIGH)
#define LED_YELLOW	RA1	//yellow LED (Active HIGH)

#define RESET		RC4	//Reset pin of the LCD display
#define ENABLE		RC5	//Enable pin of the LCD display
#define lcd_data	PORTB	//LCD 8-bit data port

#define BUTTON1		RA2	//Push button 1 (Active LOW)
#define BUTTON2 	RA3	//Push button 2 (Active LOW)
#define BUTTON3		RA4	//Push button 3 (Active LOW)

#define BUZZER		RA5	//buzzer (Active HIGH)

#define ACK_SUCCESS	0x00	//Module reply success
#define ACK_FAIL	0X01	//Module reply fail
#define ACK_NOUSER	0x05	//Module reply no user
#define ACK_USER_EXIST	0x07	//Module reply user exist
#define ACK_TIMEOUT	0x08	//Module reply timeout
#define ACK_ACCESS	0x03	//Module reply access allowed


void send_config(unsigned char data);       //function to configure LCD display
void delay(unsigned long data);             //delay function
void send_char(unsigned char data);         //function to send character to LCD display
void lcd_goto(unsigned char data);          //function to set lcd cursor to desired location
void lcd_clr(void);                         //function to clear LCD display
void send_string(const char *s)	;           //function to send string to LCD display
void uart_send(unsigned char data);         //function to transmit data by data to target device
void send_cmd(unsigned char CMD, unsigned char P1, unsigned char P2, unsigned char P3); //function to send command
unsigned char uart_receive(void);           //function to receive data from uart buffer
void mode(unsigned char data);              //modes operation
void display_status(unsigned char type, unsigned char data0, unsigned char data);   //function to display the status of reply
void receive_reply(void);                   //function to get reply from UART
void receive_reply_nodisplay(void);         //function to get reply from UART but not display the status
void setting_repeat(void);                  //function to verify admin
void CheckAdmin(void);                      //function to verify admin
void AddNew(unsigned char data);            //add new fingerprint into database
void store_eeprom(unsigned char data,unsigned char location);   //store data into specified location in EEPROM
unsigned char get_eeprom(unsigned char location);               //access EEPROM to retrieve data
void view_attendance (void);                //function to display attendance
void init_attendance(void);                 //Initialize attendance list
void clear_attendance(void);                //clear attendance marking and reset to default
void upload_HT(void);                       //function to upload attendance to Hyper Terminal
void upload_GUI(void);                      //function to upload attendance to GUI
void allign(void);                          //function to allign the text in Hyper Terminal
void ResetAdmin(void);                      //function to reset and re-assign admin

//assign global variables
bit mode_enter=0;
bit location_enter;
bit error;
bit usertype_enter=0;
bit admin;
bit day_enter=0;
bit GUIcontrol=0;
bit export_select=0;			//local variable as flag
unsigned char location=1;
unsigned char day_count=1,day_location;
unsigned char array_resp[8];
unsigned char DAY=1;
unsigned char TEMP;
unsigned char mode_count=1;

void main(void)
{
	//set I/O ports
	TRISA = 0b00011100;		//configure PORTA I/O direction
	TRISB = 0b00000000;		//configure PORTB I/O direction
	TRISC = 0b10000000;		//configure PORTC I/O direction

	//setup ADC
	ADCON1 = 0b10000110;		//PORTA digital I/O

	//configure LCD display
	send_config(0b00000001);	//clear display at lcd
	send_config(0b00000010);	//lcd return to home 
	send_config(0b00000110);	//entry mode-cursor increase 1
	send_config(0b00001100);	//display on, cursor off and cursor blink off
	send_config(0b00111000);	//function set

	BUZZER=0;
	LED_YELLOW=0;

	//display startup message
	lcd_clr();			//clear lcd
	lcd_goto(0);			//set the lcd cursor to location 0
	send_string("Cytron Tech.");	//display "Cytron Tech."
	lcd_goto(20);			//set the lcd cursor to location 20
	send_string("PR 29");		//display "PR 29"
	delay(200000);			//delay for 100000
	lcd_clr();			//clear lcd


	//setup USART
	SPBRG = 0x40;			//set baud rate to 19200 for 20MHz Cystal
	BRGH = 1;			//baud rate high speed option
	TXEN = 1;			//enable transmission
	CREN = 1;			//enable reception
	SPEN = 1;			//enable serial port


