CytronTechnologies/DIY-PR29-PIC16F876A/PIC16F876A DIY PR29/Source file/PR29.c
	if((!BUTTON1) && (!BUTTON2))		//if both SW1 and SW2 are pressed ->entering reset admin mode
	{
		delay(100000);
		if((!BUTTON1) && (!BUTTON2))	//wait for release
		{
			ResetAdmin();           //reset admin mode
		}
	}

	//configure reader setting
	send_cmd(0x2E,0x00,0x10,0x00);	//configure Time out(0x10 means timeout after approx. 7s)
	delay(10);					
	receive_reply_nodisplay();	//get reply from UART but do not display
	send_cmd(0x2d,0x00,1,0x00);	//send command to configure not allowed repeat
	delay(10);					
	receive_reply_nodisplay();	//get reply from UART but do not display

	//initialize programmed UART
	uart_init(1);

	//initialize attendance
	init_attendance();
	
while(1)
{	
	while(usertype_enter==0)                        //usertype_enter flag not set
	{
		lcd_goto(0);                            //set lcd cursor to location 0
		send_string("1. Admin login  ");	//display option 1 
		lcd_goto(20);				//set lcd cursor to location 20
		send_string("2. User login   ");	//display option 2	
		if(!BUTTON1)				//User select Admin
		{
			while(!BUTTON1);//(!ButA);	//wait for release
			CheckAdmin();			//verify process
			if(error!=1)			//if no error return
			{
			admin = 1;			//mark user as admin
			usertype_enter=1;		//set usertype_enter flag and exit loop
			}
		}
		else if (!BUTTON2)			//User select user
		{
			while(!BUTTON2);		//wait for release
			admin = 0;			//mark user as normal user
			usertype_enter=1;		//set usertype_enter flag and exit loop
		}
	}	
	lcd_clr();	
	

	while(mode_enter==0 && admin ==1 && usertype_enter==1)      //loop if admin logging on,chosen user type and mode not selected
	{
		if((!BUTTON1))                                      //check whether SW1(INCREMENT) is pressed
		{		
			while((!BUTTON1));      //wait for release
			if (mode_count<8)	//if not reaching 8th mode
			mode_count++;		//increase mode
			else
			mode_count=1;		//reset back to 1st mode			
		}
		else if((!BUTTON2))		//check whether SW2(DECREMENT) is pressed
		{		
			while((!BUTTON2));	//wait for release
			if (mode_count>1)	//if not reaching 1st mode
			mode_count--;		//decrease mode
			else
			mode_count=8;		//reset back to 8th mode			
		}
		else if(!BUTTON3)			//check whether SW3(CONFIRM) is pressed
		{
			while(!BUTTON3);                //wait for release
			mode_enter=1;                   //set mode_enter flag indicates user has chosen a mode
		}
			lcd_goto(0);                    //set the lcd cursor to location 0
			send_string("Mode= ");		//display string
			lcd_goto(6);			//set the lcd cursor to location 6
			send_char(0x30+mode_count);	//display at location 6 (0x30 is ASCII code for 0)
			lcd_goto(7);			//set the lcd cursor to location 7
			send_string("/8");		//display string
			lcd_goto(20);			//set the lcd cursor to location 20

			if (mode_count==1) 	send_string("Set Day         ");	//display description for mode 1
			else if (mode_count==2)	send_string("Add a New Data  ");	//display description for mode 2
			else if	(mode_count==3)	send_string("Delete a Data   ");	//display description for mode 3
			else if (mode_count==4)	send_string("Delete All Data ");	//display description for mode 4
			else if (mode_count==5) send_string("Change Admin    ");	//display description for mode 5
			else if (mode_count==6) send_string("View Attendance ");	//display description for mode 6
			else if (mode_count==7) send_string("Clear Attendance");	//display description for mode 7
			else if (mode_count==8) send_string("Export          ");	//display description for mode 8
	}

	while(mode_enter==0 && admin ==0 && usertype_enter==1)	//loop if normal user logging on,chosen user type and mode not selected
	{	
		while(1)                            //keep looping
		{
		lcd_goto(0);                        //set the lcd cursor to location 0
		send_string("Today is Day ");       //display string
		lcd_goto(13);                       //set the lcd cursor to location 13
		DAY=get_eeprom(0xff);               //assign value(from eeprom location 0xff) to variable
		send_char(0x30+DAY);                //display character
		lcd_goto(20);                       //set the lcd cursor to location 20
		send_string("Press 3 to mark ");    //display string
		if(!BUTTON3)                           //if SW3 is pressed
		{
			while(!BUTTON3);			//wait for release

			send_cmd(0x0c,0x00,0x00,0x00);		//send matching 1:N command
			lcd_clr();				//clear lcd screen
			lcd_goto(0);				//set the lcd cursor to location 0
			send_string("Place your thumb");	//display string
			lcd_goto(20);				//set the lcd cursor to location 20
			send_string("on the window");		//display string
			delay(100);
			receive_reply();			//get reply from UART

			if(!error)                             //if reply returns no error
			{
				if(DAY==1)                                                      //check day
				{	day_location=0x00;                                      //location to store day1 data
					store_eeprom(0x2f,day_location+3+array_resp[3]);	//get which user and mark at appropriate space
					delay(100);
				}
				else if(DAY==2)                                                 //check day
				{	day_location=0x10;                                      //location to store day2 data
					store_eeprom(0x2f,day_location+3+array_resp[3]);	//get which user and mark at appropriate space
					delay(100);
				}
				else if(DAY==3)                                                 //check day
				{	day_location=0x20;                                      //location to store day3 data
					store_eeprom(0x2f,day_location+3+array_resp[3]);	//get which user and mark at appropriate space
					delay(100);
				}
				else if(DAY==4)                                                 //check day
				{	day_location=0x30;                                      //location to store day4 data
					store_eeprom(0x2f,day_location+3+array_resp[3]);	//get which user and mark at appropriate space
					delay(100);
				}
				else if(DAY==5)                                                 //check day
				{	day_location=0x40;                                      //location to store day5 data
					store_eeprom(0x2f,day_location+3+array_resp[3]);	//get which user and mark at appropriate space
					delay(100);
				}

