CytronTechnologies/DIY-PR29-PIC16F876A/PIC16F876A DIY PR29/Source file/PR29.c
			}
		
		}
		}

	}
	lcd_clr();		//clear lcd display
	mode(mode_count);	//function call for mode selected
	delay(10);

	
}

}
//END MAIN FUNCTION//

//FUNCTIONS//

//function to configure LCD display
void send_config(unsigned char data)	//send lcd configuration 
{
	RESET=0;            //set lcd to configuration mode
	lcd_data=data;      //lcd data port = data
	ENABLE=1;           //pulse enable to confirm the data
	delay(50);
	ENABLE=0;
	delay(50);
}

//delay function
void delay(unsigned long data)			//delay function, the delay time
{						//depends on the given value
	for( ;data>0;data--);
}

//function to send character to LCD display
void send_char(unsigned char data)		//send lcd character
{
	RESET=1;				//set lcd to display mode
	lcd_data=data;				//lcd data port = data
	ENABLE=1;				//pulse enable to confirm the data
	delay(10);
	ENABLE=0;
	delay(10);
}

//function to set lcd cursor to desired location
void lcd_goto(unsigned char data)		//set the location of the lcd cursor
{						//if the given value is (0-15) the 
 	if(data<16)				//cursor will be at the upper line
	{					//if the given value is (20-35) the 
	 	send_config(0x80+data);         //cursor will be at the lower line
	}					//location of the lcd cursor(2X16):
	else					// -----------------------------------------------------
	{					// | |00|01|02|03|04|05|06|07|08|09|10|11|12|13|14|15| |
	 	data=data-20;                   // | |20|21|22|23|24|25|26|27|28|29|30|31|32|33|34|35| |
		send_config(0xc0+data);		// -----------------------------------------------------	
	}
}

//function to clear LCD display
void lcd_clr(void)				//clear the lcd
{
 	send_config(0x01);
	delay(600);	
}

//function to send string to LCD display
void send_string(const char *s)			//send a string to display in the lcd
{          
	unsigned char i=0;
  	while (s && *s)send_char (*s++);

}

//function to transmit data by data to target device
void uart_send(unsigned char data)		//transmit data through USART
{	
	while(TXIF==0);				//only send the new data after 
	TXREG=data;				//the previous data finish sent
}

//function to send command
void send_cmd(unsigned char CMD, unsigned char P1, unsigned char P2, unsigned char P3)	//send command to fingerprint module
{
	unsigned char CHK;
	CHK = CMD^P1^P2^P3^0x00;                //calulate CHK(XOR CMD,P1,P2,P3,0)
	uart_send(0xF5);			//send first byte	(fixed)
	uart_send(CMD);				//send CMD
	uart_send(P1);				//send P1
	uart_send(P2);				//send P2
	uart_send(P3);				//send P3
	uart_send(0x00);			//send 0	(fixed)
	uart_send(CHK);				//send CHK
	uart_send(0xF5);			//send 0xF5	(fixed)
}

//function to receive data from uart buffer
unsigned char uart_receive(void)    //receive data through USART
{
	unsigned char rec_data;		
	while(RCIF==0);             //wait for data
	rec_data=RCREG;
	return rec_data;            //return received data
}

//modes operation
void mode(unsigned char data)       //check which mode to proceed
{	
	
	if (data==1)                       //mode 1 set day mode
	{	
	
	while(!day_enter)                  //loop while day_enter flag is not set
	{
		if(!BUTTON1)               //check whether SW1 is pressed
		{		
			while(!BUTTON1);        //wait for release
			if (day_count<5)	//if day not reaching 5
			day_count++;		//increase 
			else
			day_count=1;		//reset back to 1			
		}
		else if(!BUTTON2)                   //check whether SW2 is pressed
		{		
			while(!BUTTON2);            //wait for release
			if (day_count>1)            //if mode not reaching 1
			day_count--;                //decrease
			else
			day_count=5;                //reset back to 5
		}
		else if(!BUTTON3)		//check whether SW3 is pressed
		{
			lcd_clr();		//clear lcd display
			LED_YELLOW=1;			//yellow LED ON
			while(!BUTTON3);	//wait for release
			if(day_count==1)                                    //day1
				{	store_eeprom(day_count,0xff);       //store at location 0xff in eeprom
	
				}
			else if (day_count==2)                              //day2
				{	store_eeprom(day_count,0xff);       //store at location 0xff in eeprom
	
				}
			else if (day_count==3)                              //day3
				{	store_eeprom(day_count,0xff);       //store at location 0xff in eeprom
			
				}
			else if (day_count==4)                              //day4
				{	store_eeprom(day_count,0xff);       //store at location 0xff in eeprom
	
				}
			else if (day_count==5)                              //day5
				{	store_eeprom(day_count,0xff);       //store at location 0xff in eeprom
	
				}
			lcd_goto(0);                                //set the lcd cursor to location 0
			send_string("Day ");                        //display string
			lcd_goto(4);                                //set the lcd cursor to location 4
			send_char(0x30 + day_count);                //send character
			lcd_goto(20);                               //set the lcd cursor to location 20
			send_string("Selected");                    //send string
			delay(200000);
			LED_YELLOW=0;                       //OFF yellow LED
			day_enter=1;                        //indicates day selected
		}
			lcd_goto(0);                        //set the lcd cursor to location 0
			send_string("Today is Day ");       //display string
			lcd_goto(13);                       //set the lcd cursor to location 13
			send_char(0x30+day_count);          //display at location 13 (0x30 is ASCII code for 0)
			lcd_goto(14);                       //set the lcd cursor to location 14
			send_string("/5");                  //display string
			lcd_goto(20);                       //set the lcd cursor to location 20
			send_string("Press 3 to set  ");    //display string
	}	
		day_enter=0;		//day select operation complete day_enter flag to zero again
	}
	else if (data==2)              //mode 2 add new data mode
	{	
		delay(10000);

		while(location_enter==0)                //loop until location_enter flag is set
		{
		lcd_goto(0);				//set the lcd cursor to location 0		
		send_string("Choose User     ");	//display string
		lcd_goto(20);				//set the lcd cursor to location 20
		send_string("User ");			//display string
		lcd_goto(25);				//set the lcd cursor to location 25
		send_char(0x30 + location);		//display character (numerical digit which started from 0x30 or zero)
		if(!BUTTON1)				//if SW1 is pressed
			{	
				while(!BUTTON1);		//waiting for release
				if (location<5)			//if location is not reaching 5
				location++;			//increment by 1
				else
				location=1;			//reset back to 1
			}
		else if(!BUTTON2)			//if SW2 is pressed
		{		
			while(!BUTTON2);		//wait for release
			if (location>1)			//if location is not reaching 1
			location--;			//decrement by 1
			else
			location=5;			//reset back to 5			
		}
		else if(!BUTTON3)				//if SW3 is pressed
			{
				while(!BUTTON3);		//waiting for release
				AddNew(location);		//function call for add new fingerprint into database at desired location
			}
		}
	}
	else if (data==3)					//mode 3 delete a data
	{
		delay(10000);

		while(location_enter==0)			//indicates location of data has been selected
		{
		lcd_goto(0);					//set the lcd cursor to location 0
		send_string("Choose User     ");                //display string
		lcd_goto(20);					//set the lcd cursor to location 20
		send_string("User ");				//display string
		lcd_goto(25);					//set the lcd cursor to location 25
		send_char(0x30 + location);			//display character (numerical digit which started from 0x30 or zero)
		if(!BUTTON1)					//if SW1 is pressed
			{	
				while(!BUTTON1);            //waiting for release
				if (location<5)             //if location not reaching 5
				location++;                 //increment by 1
				else
				location=1;                //reset back to 1
			}
		else if(!BUTTON2)				//if SW2 is pressed
		{		
			while(!BUTTON2);			//wait for release
			if (location>1)				//if location not reaching 1
			location--;				//decrement by 1
			else
			location=5;				//reset back to 5			
		}
		else if(!BUTTON3)                                       //if SW3 is pressed
			{
				while(!BUTTON3);			//waiting for release
				send_cmd(0x04,0x00,location,0x03);	//send delete data command
				delay(10);
				receive_reply();			//get reply from UART
				location_enter=1;			//set location_enter flag to exit loop
			}
		}
	}
	else if (data==4)				//mode 4 delete all data
	{
		send_cmd(0x05,0x00,location,0x03);      //send command to delete all data
		delay(10);
		receive_reply();			//get reply from UART
		if(error!=1)				//if reply returns no error
		{

		do{
			lcd_goto(0);                        //set the lcd cursor to location 0
			send_string("New Admin Needed");    //display string
			delay(200000);
			lcd_goto(0);                        //set the lcd cursor to location 0
			send_string("New Admin       ");    //display string
			lcd_goto(20);                       //set the lcd cursor to location 20
			send_string("Standby         ");    //display string
			delay(200000);		
			AddNew(0xFF);                       //add new admin fingerrprint at location 0xFF
		   }while(error==1)	;
		}
	
		
