CytronTechnologies/DIY-PR29-PIC16F876A/PIC16F876A DIY PR29/Source file/PR29.c
	}

	else if(data==5)				//mode 5 change Admin
	{
		lcd_goto(0);				//set the lcd cursor to location 0
		send_string("Verification of ");	//display string
		lcd_goto(20);				//set the lcd cursor to location 20
		send_string("Formal Admin    ")	;	//display string
		delay(200000);						
		CheckAdmin();				//verify admin function call
		if(error==0)				//if returns no error
		{
		lcd_goto(0);				//set the lcd cursor to location 0
		send_string("Deleting...");		//display string
		delay(50000);
		send_cmd(0x04,0x00,0xFF,0x00);		//delete formal admin
		receive_reply();			//receive reply
		do{									
			lcd_goto(0);			//set the lcd cursor to location 0
			send_string("New Admin       ");//display string
			lcd_goto(20);			//set the lcd cursor to location 20
			send_string("Standby         ");//display string
			delay(200000);					
			AddNew(0xFF);			//add new admin fingerprint
		   }while(error==1)	;		//if returns error, repeat
		}
	}
	else if(data==6)				//mode 6 view attendance
	{	
		view_attendance();			//call view_attendance function
	}
	else if(data==7)				//mode 7 clear attendance
	{
		LED_YELLOW=1;				//yellow LED ON
		clear_attendance();			//call clear attebdance function
		lcd_goto(0);				//set the lcd cursor to location 0
		send_string("Attendance      ");        //display string
		lcd_goto(20);				//set the lcd cursor to location 20
		send_string("Cleared         ");        //display string
		delay(200000);
		LED_YELLOW=0;				//yellow LED OFF
	}
	else if(data==8)				//mode 8 Export
	{
	
		while(export_select==0)			//while option flag is not set
		{
		lcd_goto(0);				//set the lcd cursor to location 0
		send_string("1. Export to GUI");        //display string
		lcd_goto(20);				//set the lcd cursor to location 20
		send_string("2. Export to HT ");        //display string
		if(!BUTTON1)				//if SW1 is pressed
		{
				while(!BUTTON1);                    //wait for release
				lcd_clr();                          //clear lcd
				lcd_goto(0);                        //set the lcd cursor to location 0
				send_string("Uploading...    ");    //display string
				LED_RED=1;                             //Red LED ON
				delay(150000);					
				upload_GUI();                       //call upload function
				lcd_goto(20);                       //set the lcd cursor to location 20
				send_string("Done            ");    //display string
				delay(100000);
				LED_RED=0;                             //red LED OFF
				export_select=1;                    //set flag to exit loop
			
		}
		if(!BUTTON2)                                        //if SW2 is pressed
		{
				while(!BUTTON2);                    //wait for release
				lcd_clr();                          //clear lcd
				lcd_goto(0);                        //set the lcd cursor to location 0
				send_string("Uploading...    ");    //display string
				LED_RED=1;                          //red LED ON
				delay(150000);
				upload_HT();                        //call upload function
				lcd_goto(20);                       //set the lcd cursor to location 20
				send_string("Done            ");    //display string
				delay(100000);
				LED_RED=0;                          //red LED OFF
				export_select=1;                    //set flag to exit loop
			
		}
		}
		export_select=0;			//reset flag
	}				
mode_enter=0;						//reset flag
location_enter=0;					//reset flag
error=0;						//reset error
}

//function to display the status of reply
void display_status(unsigned char type, unsigned char data0, unsigned char data)	//show the status of the reply
{
	lcd_clr();			//clear lcd display
	switch(data)
	{
		case ACK_SUCCESS:		LED_YELLOW=1;								//turn ON yellow LED
								if((type != 1) && (type != 2))
								{	lcd_goto(20);				//set the lcd cursor to location 0
									send_string("Successful      ");        //display status
								}
								else if (type ==1)				//During adding process 1
								{
									lcd_goto(0);				//set the lcd cursor to location 0
									send_string("Scanning...     ");        //display string
									lcd_goto(20);				//set the lcd cursor to location 20
									send_string("Verification 1/2");        //display string
								}
								else if (type ==2)				//During add process 2
								{
									lcd_goto(0);				//set the lcd cursor to location 0
									send_string("Scanning...     ");        //display string
									lcd_goto(20);				//set the lcd cursor to location 20
									send_string("Verification 2/2");        //display string
								}	
								delay(200000);
								LED_YELLOW=0;						//turn OFF yellow LED
								error=0;					//no error
								lcd_clr();					//clear lcd 
								break;

		case ACK_FAIL:			LED_RED=1;						//turn ON red LED
								BUZZER=1;			//ON buzzer
								lcd_goto(20);			//set the lcd cursor to location 20
								send_string("Failed");		//display status
								delay(200000);
								BUZZER=0;					//OFF buzzer
								LED_RED=0;						//turn OFF red LED
								error=1;					//indicates error
								lcd_clr();					//clear lcd display
								break;

		case ACK_TIMEOUT:		LED_RED=1;						//turn ON red LED
								BUZZER=1;			//On buzzer
								lcd_goto(20);			//set the lcd cursor to location 20
								send_string("Timeout");		//display status
								delay(200000);	
								BUZZER=0;					//OFF buzzer
								LED_RED=0;						//turn OFF red LED
								error=1;					//indicates error
								lcd_clr();					//clear lcd display
								break;

		case ACK_USER_EXIST:	LED_RED=1;                                                      //turn ON red LED
								BUZZER=1;                            //ON buzzer
								lcd_goto(20);                        //set the lcd cursor to location 20
								send_string("User Exist");           //display status
								delay(200000);		
								BUZZER=0;					//OFF buzzer
								LED_RED=0;						//turn OFF red LED
								error=1;					//indicates error
								lcd_clr();					//clear lcd display
								break;

		case ACK_NOUSER:		LED_RED=1;                                             //turn ON red LED
								BUZZER=1;                           //ON buzzer
								lcd_goto(20);                       //set the lcd cursor to location 20
								send_string("Access Denied");       //display status
								delay(200000);
								BUZZER=0;			//OFF buzzer
								LED_RED=0;				//turn OFF red LED
								error=1;			//indicates error
								lcd_clr();			//clear lcd display
								break;
		
		case ACK_ACCESS:		LED_YELLOW=1;						//turn ON yellow LED
								if(data0!=0xFF)			//if not admin (admin stored at location 0xFF)
								{
								lcd_goto(0);			//set the lcd cursor to location 0
								send_string("Hello User ");	//display string
								lcd_goto(11);			//set the lcd cursor to location 11
								send_char(0x30 + data0);	//display character (numerical digit which started from 0x30 or zero)
								lcd_goto(20);			//set the lcd cursor to location 20
								send_string("Welcome");		//display string
								error=0;			//no error
								}
								else
								{
								lcd_goto(0);			//set the lcd cursor to location 0
								send_string("Hello Admin");	//display string
								}
								delay(200000);
								LED_YELLOW=0;			//turn OFF yellow LED
								lcd_clr();			//clear lcd display
								break;
				

		default:				LED_RED=1;				//turn ON red LED
								LED_YELLOW=1;			//turn ON yellow LED
								BUZZER=1;			//turn ON buzzer
								lcd_goto(20);			//set lcd cursor to location 20
								send_string("Error");           //display string
								delay(200000);
								BUZZER=0;                       //turn OFF buzzer
								LED_RED=0;                      //turn OFF red LED
								LED_YELLOW=0;                   //turn OFF yellow LED
                                                                    error=1;                    //indicates error
								lcd_clr();                      //clear lcd display
								break;

