CytronTechnologies/DIY-PR29-PIC16F876A/PIC16F876A DIY PR29/Source file/PR29.c
	}
}

//function to get reply from UART
void receive_reply(void)						
{

	unsigned char i;
	for(i=0;i<8;i++)                                                //store the reply in the array
	array_resp[i]=uart_receive();					//assign values to array
	display_status(array_resp[1],array_resp[3],array_resp[4]);	//retrieve the informations
	delay(1000);

}

//function to get reply from UART but not display the status
void receive_reply_nodisplay(void)
{
	unsigned char i;
	for(i=0;i<8;i++)			//store the reply in the array
	array_resp[i]=uart_receive();		//assign values to array
}

//function to verify admin
void CheckAdmin(void)
{
	send_cmd(0x0b,0x00,0xFF,0x00);		//send command for 1:1 Matching
	lcd_goto(0);				//set the lcd cursor to location 0
	send_string("Place your thumb");	//display string
	lcd_goto(20);				//set the lcd cursor to location 20
	send_string("on the window");		//display string
	delay(100);
	receive_reply();			//get reply from UART
}

//add new fingerprint into database
void AddNew(unsigned char data)
{
	send_cmd(0x01,0x00,data,0x03);		//send adding new fingerprint command
	lcd_goto(0);				//set the lcd cursor to location 0
	send_string("Place your thumb");	//display string
	lcd_goto(20);				//set the lcd cursor to location 20
	send_string("on the window");		//display string
	delay(5000);		
	receive_reply();			//get reply from UART
	location_enter=1;			//indicates location of data has been selected
	if(!error)				//if no error
	{
	lcd_clr();                              //clear lcd display
	lcd_goto(0);
	send_string("Scanning...     ");
	lcd_goto(20);
	send_string("Verification 1/2");
	send_cmd(0x02,0x00,data,0x03);              //send verifying fingerprint #1 command
	receive_reply();                            //get reply from UART
		if(!error)                          //if no error
		{
		lcd_clr();                          //clear lcd display
		lcd_goto(0);
		send_string("Scanning...     ");
		lcd_goto(20);
		send_string("Verification 2/2");			
		send_cmd(0x03,0x00,data,0x03);      //send verifying fingerprint #2 command
		receive_reply();                    //get reply from UART
		}

	}

}

//store data into specified location in EEPROM
void store_eeprom(unsigned char data,unsigned char location)
{
	EEPROM_WRITE(location,data);                //write data
	while(WR)                                   //wait until it finish
	continue;
}

//access EEPROM to retrieve data
unsigned char get_eeprom(unsigned char location)
{
	unsigned char value;
	value= EEPROM_READ(location);               //read eeprom and assign the data to variable
	return value;                               //return data
}

//function to display attendance
void view_attendance (void)
{
	lcd_clr();					//clear lcd
	lcd_goto(0);     				//set the lcd cursor to location 0
	send_string("User 1 2 3 4 5 ");                 //display string
	lcd_goto(20);					//set the lcd cursor to location 20
	unsigned char x;
	for(x=0; x<4; x++)		//day1 0x00
	{	TEMP=get_eeprom(x);	//get "D","A","Y","1"
		send_char(TEMP);	//display characters
	}
	for(x=4; x<9; x++)		//loop 5 times for 5 days
	{	send_char(0x20);	//display " "
		TEMP=get_eeprom(x);	//retrieve marking
		send_char(TEMP);	//display marking
	}
	delay(300000);			
	lcd_goto(20);			//set the lcd cursor to location 20
	for(x=16; x<20; x++)            //day2 0x10
	{	TEMP=get_eeprom(x);	//get "D","A","Y","2"
		send_char(TEMP);	//display characters
	}
	for(x=20; x<25; x++)            //loop 5 times for 5 days
	{	send_char(0x20);	//display " "
		TEMP=get_eeprom(x);	//retrieve marking
		send_char(TEMP);	//display marking
	}
	delay(300000);
	lcd_goto(20);			//set the lcd cursor to location 20
	for(x=32; x<36; x++)            //day3 0x20
	{	TEMP=get_eeprom(x);	//get "D","A","Y","3"
		send_char(TEMP);	//display characters
	}
	for(x=36; x<41; x++)            //loop 5 times for 5 days
	{	send_char(0x20);	//display " "
		TEMP=get_eeprom(x);	//retrieve marking
		send_char(TEMP);	//display marking
	}			
	delay(300000);
	lcd_goto(20);			//set the lcd cursor to location 20
	for(x=48; x<52; x++)            //day4 0x30
	{	TEMP=get_eeprom(x);	//get "D","A","Y","4"
		send_char(TEMP);	//display characters
	}
	for(x=52; x<57; x++)            //loop 5 times for 5 days
	{	send_char(0x20);	//display " "
		TEMP=get_eeprom(x);	//retrieve marking
		send_char(TEMP);	//display marking
	}			
	delay(300000);
	lcd_goto(20);			//set the lcd cursor to location 20
	for(x=64; x<68; x++)            //day5 0x40
	{	TEMP=get_eeprom(x);	//get "D","A","Y","5"
		send_char(TEMP);	//display characters
	}
	for(x=68; x<73; x++)            //loop 5 times for 5 days
	{	send_char(0x20);	//display " "
		TEMP=get_eeprom(x);	//retrieve marking
		send_char(TEMP);	//display marking
	}	
	delay(300000);		

}		

//Initialize attendance list
void init_attendance(void)
{
					day_location=0x00;			//location for day1
					store_eeprom('D',day_location);		//store character
					store_eeprom('A',day_location+1);	//store character
					store_eeprom('Y',day_location+2);	//store character
					store_eeprom('1',day_location+3);	//store character

					day_location=0x10;			//location for day2
					store_eeprom('D',day_location);		//store character
					store_eeprom('A',day_location+1);	//store character
					store_eeprom('Y',day_location+2);	//store character
					store_eeprom('2',day_location+3);	//store character

					day_location=0x20;			//location for day3
					store_eeprom('D',day_location);		//store character
					store_eeprom('A',day_location+1);	//store character
					store_eeprom('Y',day_location+2);	//store character
					store_eeprom('3',day_location+3);	//store character

					day_location=0x30;			//location for day4
					store_eeprom('D',day_location);		//store character
					store_eeprom('A',day_location+1);	//store character
					store_eeprom('Y',day_location+2);	//store character
					store_eeprom('4',day_location+3);	//store character

					day_location=0x40;			//location for day5
					store_eeprom('D',day_location);		//store character
					store_eeprom('A',day_location+1);	//store character
					store_eeprom('Y',day_location+2);	//store character
					store_eeprom('5',day_location+3);	//store character

