CytronTechnologies/DIY-PR29-PIC16F876A/PIC16F876A DIY PR29/Source file/PR29.c
}
//clear attendance marking and reset to default
void clear_attendance(void)
{
					day_location=0x00;			//location for day1
					store_eeprom('D',day_location);		//store character
					store_eeprom('A',day_location+1);	//store character
					store_eeprom('Y',day_location+2);	//store character
					store_eeprom('1',day_location+3);	//store character
					store_eeprom(0xff,day_location+4);	//reset marking
					store_eeprom(0xff,day_location+5);	//reset marking
					store_eeprom(0xff,day_location+6);	//reset marking
					store_eeprom(0xff,day_location+7);	//reset marking
					store_eeprom(0xff,day_location+8);	//reset marking
					day_location=0x10;			//location for day2
					store_eeprom('D',day_location);		//store character
					store_eeprom('A',day_location+1);	//store character
					store_eeprom('Y',day_location+2);	//store character
					store_eeprom('2',day_location+3);	//store character
					store_eeprom(0xff,day_location+4);	//reset marking
					store_eeprom(0xff,day_location+5);	//reset marking
					store_eeprom(0xff,day_location+6);	//reset marking
					store_eeprom(0xff,day_location+7);	//reset marking
					store_eeprom(0xff,day_location+8);	//reset marking
					day_location=0x20;
					store_eeprom('D',day_location);		//store character
					store_eeprom('A',day_location+1);	//store character
					store_eeprom('Y',day_location+2);	//store character
					store_eeprom('3',day_location+3);	//store character
					store_eeprom(0xff,day_location+4);	//reset marking
					store_eeprom(0xff,day_location+5);	//reset marking
					store_eeprom(0xff,day_location+6);	//reset marking
					store_eeprom(0xff,day_location+7);	//reset marking
					store_eeprom(0xff,day_location+8);	//reset marking
					day_location=0x30;
					store_eeprom('D',day_location);		//store character
					store_eeprom('A',day_location+1);	//store character
					store_eeprom('Y',day_location+2);	//store character
					store_eeprom('4',day_location+3);	//store character
					store_eeprom(0xff,day_location+4);	//reset marking
					store_eeprom(0xff,day_location+5);	//reset marking
					store_eeprom(0xff,day_location+6);	//reset marking
					store_eeprom(0xff,day_location+7);	//reset marking
					store_eeprom(0xff,day_location+8);	//reset marking
					day_location=0x40;
					store_eeprom('D',day_location);		//store character
					store_eeprom('A',day_location+1);	//store character
					store_eeprom('Y',day_location+2);	//store character
					store_eeprom('5',day_location+3);	//store character
					store_eeprom(0xff,day_location+4);	//reset marking
					store_eeprom(0xff,day_location+5);	//reset marking
					store_eeprom(0xff,day_location+6);	//reset marking
					store_eeprom(0xff,day_location+7);	//reset marking
					store_eeprom(0xff,day_location+8);	//reset marking
}

//function to upload attendance to Hyper Terminal
void upload_HT(void)
{
	unsigned char address;				
	unsigned char count;
	unsigned char array_title[40]= {"+-+-+- Attendance List -+-+- Cytron PR29"};	//display string

	for(count=0;count<40;count++)			//loop for 40 times
	uart_write(2,array_title[count]);		//write to programmed uart
	for(count=0;count<20;count++)			//loop for 20 times
	{	uart_write(2,'+');			//write '+'
		uart_write(2,'-');			//write '-'
	}
	for(count=0;count<80;count++)			//loop for 80 times
	uart_write(2,' ');				//write to programmed uart
	uart_write(2,'U');				//write to programmed uart
	uart_write(2,'s');				//write to programmed uart
	uart_write(2,'e');				//write to programmed uart
	uart_write(2,'r');				//write to programmed uart
	for(count=1;count<6;count++)			//loop for 5 times
	{
		uart_write(2,' ');			//write ' '
		uart_write(2,0x30+count);		//write user id 1 to 5
	}
	allign();					//function making allignment

	address=0x00;					//set address for day1
	count=address;					//assign value in address to count
	for(address;count<=address+3;count++)           //DAY1 0x00->0x03
	{
		TEMP=get_eeprom(count);			//get "D","A","Y","1"
		uart_write(2,TEMP);			//write to programmmed uart
	}
	address=count;					//assign value in count to address
	for(count;count<=address+4;count++)		//loop 5 times to get marking
	{
		TEMP=get_eeprom(count);			//get marking
		uart_write(2,' ');			//write to programmed uart
		if(TEMP==0xff)	TEMP=0x30;		//if 0xff (no marking) replace with 0x30( zero )
		uart_write(2,TEMP);			//write to programmed uart
	}
	allign();					//function making allignment

	address=0x10;					//set address for day2
	count=address;					//assign value in address to count
	for(count;count<=address+3;count++)		//DAY2 0x10->0x13
	{
		TEMP=get_eeprom(count);			//get "D","A","Y","2"
		uart_write(2,TEMP);			//write to programmmed uart
	}
	address=count;					//assign value in count to address
	for(count;count<=address+4;count++)		//loop 5 times to get marking
	{
		TEMP=get_eeprom(count);			//get marking
		uart_write(2,' ');			//write to programmed uart
		if(TEMP==0xff)	TEMP=0x30;		//if 0xff (no marking) replace with 0x30( zero )
		uart_write(2,TEMP);			//write to programmed uart
	}
	allign();					//function making allignment

	address=0x20;					//set address for day3
	count=address;					//assign value in address to count
	for(count;count<=address+3;count++)		//DAY3 0x20->0x23
	{
		TEMP=get_eeprom(count);			//get "D","A","Y","3"
		uart_write(2,TEMP);			//write to programmmed uart
	}
	address=count;					//assign value in count to address
	for(count;count<=address+4;count++)		//loop 5 times to get marking
	{
		TEMP=get_eeprom(count);			//get marking
		uart_write(2,' ');			//write to programmed uart
		if(TEMP==0xff)	TEMP=0x30;              //if 0xff (no marking) replace with 0x30( zero )
		uart_write(2,TEMP);			//write to programmed uart
	}
	allign();					//function making allignment
                                                     
	address=0x30;					//set address for day4
	count=address;					//assign value in address to count
	for(count;count<=address+3;count++)		//DAY4 0x30->0x33
	{
		TEMP=get_eeprom(count);			//get "D","A","Y","4"
		uart_write(2,TEMP);			//write to programmmed uart
	}
	address=count;					//assign value in count to address
	for(count;count<=address+4;count++)		//loop 5 times to get marking
	{
		TEMP=get_eeprom(count);			//get marking
		uart_write(2,' ');			//write to programmed uart
		if(TEMP==0xff)	TEMP=0x30;		//if 0xff (no marking) replace with 0x30( zero )
		uart_write(2,TEMP);			//write to programmed uart
	}
	allign();					//function making allignment

