CytronTechnologies/DIY-PR29-PIC16F876A/PIC16F876A DIY PR29/Source file/PR29.c
	address=0x40;					//set address for day5
	count=address;					//assign value in address to count
	for(count;count<=address+3;count++)		//DAY5 0x40->0x43
	{
		TEMP=get_eeprom(count);			//get "D","A","Y","5"
		uart_write(2,TEMP);			//write to programmmed uart
	}
	address=count;					//assign value in count to address
	for(count;count<=address+4;count++)		//loop 5 times to get marking
	{
		TEMP=get_eeprom(count);			//get marking
		uart_write(2,0xff);			//write to programmed uart
		if(TEMP==0xff)	TEMP=0x30;		//if 0xff (no marking) replace with 0x30( zero )
		uart_write(2,TEMP);			//write to programmed uart
	}
	allign();					//function making allignment
	for(count=0;count<80;count++)			//loop 80 times 
	uart_write(2,' ');				//to blank a line
	for(count=0;count<40;count++)			//loop 40 times
	{	uart_write(2,'+');			//write to programmed uart
		uart_write(2,'-');			//write to programmed uart

	}
}

//function to upload attendance to GUI
void upload_GUI(void)
{
	unsigned char address;
	unsigned char count;

	address=0x00;					//day1 location
	count=address;					//assign value in address to count
	for(address;count<=address+3;count++)           //DAY1 0x00->0x03
	{
		TEMP=get_eeprom(count);			//get "D","A","Y","1"
		uart_write(2,TEMP);			//write to programmed uart
	}
	address=count;					//assign value in count to address
	for(count;count<=address+4;count++)		//loop 5 times to get marking
	{
		TEMP=get_eeprom(count);			//get marking
		if(TEMP==0xff)	TEMP=0x30;		//if 0xff (no marking) replace with 0x30( zero )
		uart_write(2,TEMP);			//write to programmed uart
	}

	address=0x10;					//day2 location
	count=address;					//assign value in address to count
	for(count;count<=address+3;count++)		//DAY2 0x10->0x13
	{
		TEMP=get_eeprom(count);			//get "D","A","Y","2"
		uart_write(2,TEMP);			//write to programmed uart
	}
	address=count;					//assign value in count to address
	for(count;count<=address+4;count++)		//loop 5 times to get marking
	{
		TEMP=get_eeprom(count);			//get marking
		if(TEMP==0xff)	TEMP=0x30;		//if 0xff (no marking) replace with 0x30( zero )
		uart_write(2,TEMP);			//write to programmed uart
	}

	address=0x20;					//day3 location
	count=address;					//assign value in address to count
	for(count;count<=address+3;count++)		//DAY3 0x20->0x23
	{
		TEMP=get_eeprom(count);			//get "D","A","Y","3"
		uart_write(2,TEMP);			//write to programmed uart
	}
	address=count;					//assign value in count to address
	for(count;count<=address+4;count++)		//loop 5 times to get marking
	{
		TEMP=get_eeprom(count);			//get marking				
		if(TEMP==0xff)	TEMP=0x30;		//if 0xff (no marking) replace with 0x30( zero )
		uart_write(2,TEMP);			//write to programmed uart
	}
                                                     
	address=0x30;					//day4 location
	count=address;					//assign value in address to count
	for(count;count<=address+3;count++)		//DAY4 0x30->0x33
	{
		TEMP=get_eeprom(count);			//get "D","A","Y","4"
		uart_write(2,TEMP);			//write to programmed uart
	}
	address=count;					//assign value in count to address
	for(count;count<=address+4;count++)		//loop 5 times to get marking
	{
		TEMP=get_eeprom(count);			//get marking
		if(TEMP==0xff)	TEMP=0x30;		//if 0xff (no marking) replace with 0x30( zero )
		uart_write(2,TEMP);			//write to programmed uart
	}

	address=0x40;					//day5 location
	count=address;					//assign value in address to count
	for(count;count<=address+3;count++)		//DAY5 0x40->0x43
	{
		TEMP=get_eeprom(count);			//get "D","A","Y","5"
		uart_write(2,TEMP);			//write to programmed uart
	}
	address=count;					//assign value in count to address
	for(count;count<=address+4;count++)		//loop 5 times to get marking
	{
		TEMP=get_eeprom(count);			//get marking
		if(TEMP==0xff)	TEMP=0x30;		//if 0xff (no marking) replace with 0x30( zero )
		uart_write(2,TEMP);			//write to programmed uart
	}

}

//function to allign the text in Hyper Terminal
void allign(void)
{
	unsigned char Allign;
	for(Allign=0;Allign<66;Allign++)		//loop
	uart_write(2,' ');				//write ' ' to programmed uart
}

//function to reset and re-assign admin
void ResetAdmin(void)
{
	lcd_goto(0);					//set the lcd cursor to location 0
	send_string("Resetting Admin...");		//display string
	delay(200000);
	send_cmd(0x04,0x00,0xFF,0x00);			//command to delete formal admin
	receive_reply();				//get reply from uart
	lcd_goto(0);					//set the lcd cursor to location 0
	send_string("New Admin Needed");		//display string
	delay(200000);
	do{
		lcd_goto(0);				//set the lcd cursor to location 0
		send_string("New Admin       ");	//display string
		lcd_goto(20);				//set the lcd cursor to location 20
		send_string("Standby");			//display string
		delay(200000);
		AddNew(0xff);				//add new admin
	  }	while(error==1)	;			//repeat if new admin not added successfully
}
